<template>
 <!-- 竖向导航栏 -->
	<ul class="vertical">
		<li @click="showContent('新安县，隶属河南省洛阳市。位于洛阳市西部，北临黄河，与济源市、垣曲县隔河相望。南接宜阳县，西邻渑池县、义马市，东与孟津区、洛阳市毗连， 总面积1160平方千米。 2022年，新安县常住人口47.6万人。 截至2023年6月，新安县下辖1个街道、10个镇。 县政府驻黄河大道1032号。新安是河洛文化的主要发祥地和仰韶文化的集中分布区。 秦，置新安县， 取新治安宁之意。 1983年，改属洛阳市。 共有全国重点文物保护单位3处，是河南省扩权县 、国家卫生县城 、国家园林县城 、全国文明城市。 ')">新安县</li>
		<li @click="showContent('栾川县，隶属河南省洛阳市。位于河南省西部，洛阳市西南部。 [6]东与嵩县毗邻，西与卢氏县接壤，南与西峡县抵足，北与洛宁县摩肩， [2]总面积2476.98平方公里。 [2]截至2022年10月，栾川县下辖1个街道、11个镇、2个乡， [8]2022年，栾川县常住人口31.94万人。 [5]《水经注》载：“世人谓伊水为鸾水，故名斯川为鸾川也”。 [6]北宋崇宁三年（1104年），栾川置县。金，栾川废县为镇，隶卢氏县。1947年，置栾川县。1960年，取消栾川县名称，并入嵩县。1961年，恢复栾川县。1986年，洛阳专区撤销，栾川县隶洛阳市。 [6]2019年5月8日，河南省人民政府批准栾川县退出贫困县序列。 [4]')">栾川县</li>
		<li @click="showContent('嵩县地域，炎帝时称伊国，夏为豫州伊阙地，商称有莘之野，春秋为陆浑戎地，汉置县，金改州，明降州为县， [23]1986年2月23日，嵩县属洛阳市。 [16]拥有中药材1300余种，被誉为“中药宝库”。盛产于嵩南山区的柴胡被称作“嵩胡”，是中国原产地保护品种，皂角、银杏被认定为国家地理保护标志农产品。 [23]2020年2月26日，河南省人民政府批准嵩县退出贫困县，正式脱贫摘帽。 [1]2020年7月29日，入选2019年重新确认国家卫生乡镇（县城）名单。 [2]嵩县建有世界地质公园、国家5A级景区白云山，国家4A级景区天池山等。 [23]')">嵩县</li>
		<li @click="showContent('汝阳县，隶属河南省洛阳市。位于河南省西部，地处豫西伏牛山区、北汝河上游，距洛阳市区74公里，是中国历史名酒——杜康酒的发祥地，史称“酒祖之乡”。2021年10月，汝阳县下辖8个镇、5个乡。 [15]216个行政村，总面积1332平方公里。汝阳县4A级旅游景区有西泰山、恐龙谷漂流，3A级旅游景区有龙隐、恐龙国家地址公园。2020年2月26日，河南省人民政府批准汝阳县退出贫困县，正式脱贫摘帽。 [1]2020年7月29日，入选2017-2019周期国家卫生乡镇（县城）命名名单。 [2]')">汝阳县</li>
		<li @click="showContent('宜阳县地域，夏、商时属于豫州雒西地，战国为韩国宜阳邑。1986年4月，洛阳专区撤销，宜阳县改属洛阳市。 [3]宜阳县境内省道八官线、安虎线横穿东西，省道南车线、县道宜新路和宜白路贯穿南北，洛阳市西南环绕城高速、郑西高速铁路穿境而过。 [4]自东周时期置县已有2400多年历史，是召伯听政之处、“诗鬼”李贺故里；有韩国故城等6处全国重点文物保护单位以及虎头寺石窟等6处河南省重点文物保护单位 [16]。地处汉唐洛阳—西安两京故道，孕育诞生了辉煌灿烂的诗词文化、西游文化、驿馆文化。 [52]')">宜阳县</li>
		<li @click="showContent('洛宁是河洛文化发祥地，境内有标志中华文明渊源的“洛出书处”、“仓颉造字台”、“伶伦制管”等众多历史文化遗存，是中华文明之源、文字之源、音乐之源。洛宁林木覆盖率达59%，有国家森林公园、国家地质公园、4A景区神灵寨；楼梯山狩猎场、全宝山森林公园、蓄水量13亿立方米的故县西子湖等自然生态景观风光宜人。洛宁是世界纬度最高的淡竹原产地，现有原生态古竹林1万余亩，素有“北国竹乡”之美誉。洛宁县已成功创建了全国文明城市提名城市、国家级园林城市、国家生态文明示范县；被评为美丽中国魅力文旅目的地、中国最美山水生态宜居县。')">洛宁县</li>	
		<li @click="showContent('伊川县，隶属河南省洛阳市。位于河南省西部，北依洛阳，南与嵩县一衣带水，西与宜阳县接壤。地处豫西浅山丘陵区，总面积1059平方千米。截至2022年10月，伊川县辖2个街道，12个镇，1个乡， [14]2022年，伊川县常住人口76.80万人。 [5]伊川县，是省委、省政府确定的23个首批对外开放重点县、35个扩权县之一。先后荣获全国科技先进县、国家园林县城、国家卫生县城、国家级生态示范区建设先进县和全省双拥模范县、对外开放先进县、市县经济社会发展考评先进县等荣誉称号。2019年5月9日，经省级专项评估检查，达到脱贫摘帽标准，正式退出贫困县序列。')">伊川县</li>	
	</ul>
	<!-- 横向导航栏 -->
	<ul class="horizontal">
		<li @click="showContent('洛龙区前身是洛阳市郊区，2000年，更名为洛龙区。洛龙区境内有关林站、甘泉河站、洛龙站、龙门站等高速公路出入口，有洛阳唯一的高铁站——郑西高铁洛阳龙门站，地铁二号线贯穿全域，主要景点有：龙门石窟、关林庙、中国国花园、隋唐洛阳城里坊区遗址、邵雍故居等。 [19]洛龙区围绕“龙头企业+中小企业科创园”发展模式，着力打造光电电子元器件、高端轴承、大数据、生物医药、文旅文创、白色家电和新能源、服装制造七大产业集群。')">洛龙区</li>
		<li @click="showContent('老城区，隶属河南省洛阳市。位于河南省洛阳市中东部和北部，位于洛阳中心城区中东部和北部，也是全市的经济、文化、商贸中心。辖9个街道办事处，含32个社区居委会、11个行政村，总面积56.74平方公里 [7]，城区面积4.7平方公里。根据第七次人口普查数据，截至2020年11月1日零时，老城区常住人口为252165人。 [5]老城区域内地形西北高、东南低，地形复杂，气候多样。人力资源、旅游资源丰富，第三产业比较发达，工业经济相对不足，属典型的生活消费区和现代商贸区。')">老城区</li>
		<li @click="showContent('河洛文化起源于以洛阳为中心的中国古代河洛地区，是中华文化的源头之一。古今兴废看洛阳，“六朝”存亡读西工。自西周成王五年（前1038年）在这里建王城后，先后有东周、隋、唐、后梁、后唐、后晋等6个朝代30个帝王在此建都。 [12]民国十二年（1923年），河南省长公署迁驻西工，1975年11月，市属各区的行政区划调整，恢复西工区建制。济洛高速南北贯穿，310国道、小浪底专用线过境。洛河流经辖区。获得2017年度全省综治和平安建设优秀县（市、区）称号。境内有天子驾六博物馆、应天门遗址、西工兵营、樱桃沟风景区等景点。')">西工区</li>
		<li @click="showContent('洛阳市瀍河回族区，1957年11月15日建区，因古老的瀍河横贯其中且回族群众相对聚居而得名，是全国五个少数民族城市区之一，是中国（河南）自由贸易试验区洛阳片区联动发展区。 [16]2023年，瀍河回族区辖8个街道，1个镇； [20-21]有回族、汉族、满族、蒙古族等22个民族。根据第七次人口普查数据，截至2020年11月1日零时，瀍河回族区常住人口为222833人。')">瀍河回族区</li>
		<li @click="showContent('商代开始，涧西作为京畿禁苑。新中国成立后，属洛阳县第四区。1954年，改为洛阳市第四区。1955年，第四区改为涧西区。 [3]是国家知识产权强县工程试点县 [21]、全国义务教育发展基本均衡县 [24]、全国社区治理和服务创新实验区 [25]、首批河南省“五育”并举实验区。 [12]')">涧西区</li>
		<li @click="showContent('周，设偃师县。1993年，偃师撤县设市。 [3]2021年3月，撤销县级偃师市，设立洛阳市偃师区。偃师东距省会郑州80千米，西距古都洛阳30千米，是国家级重点开发区域，境内陇海铁路、郑西高铁、连霍高速、310国道、207国道交汇贯通，形成了以国道、省道、县道为主干，以乡村道路为支脉，四通八达的道路交通网络。伊河、洛河贯穿全境，并在此交汇。偃师区是客家文化的源头，拥有独特的区位优势，是中原经济区郑洛城市工业走廊上的重要节点。')">偃师区</li>
		<li @click="showContent('孟津区（原孟津县，现已撤销），位于河南省中西部丘陵山区，是洛阳市下辖县之一，其东距郑州110公里，西距三门峡90公里，南与洛阳市区毗邻，北临黄河，全县辖十镇两个产业聚集区，219个村委会、9个居委会，总面积758.7平方公里，县政府驻城关镇')">孟津区</li>
		<li @click="back"><img src="../assets/img/arrow-return-left.svg" alt="Bootstrap" width="20" ></li>						
	</ul>
	<div class="change">
	  	<el-button @click="switchTheme('light')"><el-icon><Sunny /></el-icon></el-button>  
		<el-button  @click="switchTheme('dark')"><el-icon><Moon /></el-icon></el-button>
	</div>
	<!-- 页面内容 -->
	<div :class="about">
		<div class="container">
			<p>{{ currentContent }}</p>
		</div>
	</div>
</template>

<script setup>
import { ref } from 'vue';
import { useRouter } from 'vue-router';
import { ElButton, ElIcon } from 'element-plus';
const currentContent = ref('洛阳市位于河南省西部，横跨黄河中下游南北两岸，因地处洛河之阳而得名，是华夏文明的重要发祥地、国务院首批公布的国家历史文化名城、国家区域性中心城市、中原城市群副中心城市、丝绸之路的东方起点之一、隋唐大运河的中心。现辖7县7区，2个国家级开发区、2个省级开发区，18个省级产业集聚区。总面积1.52万平方公里，中心城区面积2274平方公里，全市常住人口705.67万人，其中城镇人口458.53万人、城镇化率64.98%。“十三五”期间，全市经济总量先后突破4000亿元、5000亿元大关，2020年达到5128.4亿元、同比增长3%，总量在全国地级以上城市排名第45位，主要经济指标增速持续高于全国全省平均水平、稳居全省第一方阵。');
const showContent = (content) => {
  currentContent.value = content;
};

// 创建一个响应式的 currentRoute 引用
const router = useRouter();
const back = () => {
  router.push('/');
};

const about = ref('light'); // 默认主题为 'light'
 const switchTheme = (newTheme) => {
      about.value = newTheme;
    };
</script>

<style scoped>
.light {	
   	background-color: #9cd1dd;
	display: flex;
	justify-content: center;
	align-items: center;
	height: 100vh; /* 确保有足够的高度来展示居中内容 */
   }

.dark{
	background-color: #5b6776;
	display: flex;
	justify-content: center;
	align-items: center;
	height: 100vh; /* 确保有足够的高度来展示居中内容 */
   }

	ul{
		list-style-type: none;
		 position: fixed;/* 固定定位 */
	}

	li {
		display: block;
		text-decoration: none;
		text-align: center;
	}

 li:hover {
   background-color: #ddd;
   color: black;
 }
/* 竖向导航栏样式 */
ul.vertical {  
    margin: 100px 0;
    padding: 0;
    width: 100px;
    background-color: cadetblue;   
    height: 60%;
    overflow: auto;
}

.vertical li {   
    color: #000;
    padding: 8px 16px;
}

/* 横向导航栏样式 */
ul.horizontal {
    overflow: hidden;
    background-color: #333; /* 横向导航栏背景颜色 */
    top: 0; /* 顶部位置 */
    width: 100%; /* 宽度设置为100% */
    z-index: 1000; /* 确保导航栏在最上层 */
}


.horizontal li {
    display: inline-block; /* 使用inline-block进行横向排布 */
    margin-right: 10px; /* 添加一些右边距 */
	color: white;
	padding: 14px 16px;
}

.change{
	position: fixed;
	top: 80px; /* 顶部位置 */
	right:20px;
}

/*内容内容内容内容内容内容内容内容内容内容内容内容内容内容*/

.container{
	background-color: aliceblue;
	height: auto;
	width: 50%;
	padding: 20px;
	text-align: left;
	border-radius: 8px;
}

	
</style>